from aiogram import Router, types, F
from aiogram.filters import Command
from keyboards.start_kb import start_keyboard, continue_keyboard
from keyboards.pay_kb import payment_keyboard
from services.storage import set_unsubscribed

router = Router()


@router.message(Command("start"))
async def start_cmd(message: types.Message):
    # Якщо людина повернулась — більше не unsubscribed
    set_unsubscribed(message.from_user.id, False)

    text = (
        "Вітаємо!\n"
        "Ви підписалися на бот FinanceForTeens! \n"
        "Це курс з фінансової грамотності. Він створений для тих мрійників, хто потребує додаткових знань "
        "та систематизації дій на шляху до реалізації своїх ідей!\n"
        "Ну як, цікаво?"
    )

    await message.answer(text, reply_markup=start_keyboard())


@router.callback_query(F.data == "start_yes")
async def start_yes(callback: types.CallbackQuery):
    text = (
        "Курс розрахований на підлітків 14–19 років. У ньому поєднані фінансова грамотність, "
        "основи підприємництва, логіка та психологія.\n"
        "Заняття побудовані у форматі «від простого до складного», щоб допомогти:\n"
        "• зрозуміти свої цілі  \n"
        "• побачити шлях їх досягнення  \n"
        "• надихнутися історіями успішних людей  \n"
        "Продовжимо?"
    )

    await callback.message.answer(text, reply_markup=continue_keyboard())


@router.callback_query(F.data == "cont_yes")
async def cont_yes(callback: types.CallbackQuery):
    text = (
        "👇 У нас є декілька форматів, оберіть той, що підходить вам найбільше. "
        "Після оплати ми попросимо заповнити анкету та надішлемо доступ до курсу.\n\n"
        "А) Повна оплата — 1500 грн. Курс з 12 уроків, доступ назавжди.\n\n"
        "B) Оплата частинами. 800 грн, доступ до перших 6 уроків відкриється одразу після платежу\n\n"
        "С) PRO доступ. 2000 грн. Доступ до всього курсу + менторський супровід 1 місяць!\n\n"
        "D) MAX-програма. 3490 грн. 6-місячна програма + додаткові модулі + спільнота + фідбек!"
    )

    await callback.message.answer(text, reply_markup=payment_keyboard())
